nguyenvuhung/STM32Cube_FW_F4/Drivers/BSP/STM32F429_EVAL_CUSTOMIZE/stm324x9i_eval_revision.c
  return status;
}
void TS2_EnableIT(void){
	GPIO_InitTypeDef GPIO_Init_Structure;
  
  /* Configure Interrupt mode for SD detection pin */ 
  GPIO_Init_Structure.Mode      = GPIO_MODE_IT_RISING_FALLING;
  GPIO_Init_Structure.Pull      = GPIO_PULLUP;
  GPIO_Init_Structure.Speed     = GPIO_SPEED_FAST;
  GPIO_Init_Structure.Pin       = TP_IRQ_PIN;
  HAL_GPIO_Init(TP_IRQ_PORT, &GPIO_Init_Structure);
    
  /* NVIC configuration for SDIO interrupts */
  HAL_NVIC_SetPriority(TP_IRQn, 5, 0);
  HAL_NVIC_EnableIRQ(TP_IRQn);
}

static void SPI_MspInit(void){
	GPIO_InitTypeDef GPIO_InitStruct;
	
	   /* Peripheral clock enable */
    __SPI2_CLK_ENABLE();
	
		/* GPIO clock enable*/
		__GPIOB_CLK_ENABLE();
		__GPIOC_CLK_ENABLE();
  
    /**SPI2 GPIO Configuration    
    PC2     ------> SPI2_MISO
    PB13     ------> SPI2_SCK
    PB15     ------> SPI2_MOSI 
    */
    GPIO_InitStruct.Pin = GPIO_PIN_2;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FAST;
    GPIO_InitStruct.Alternate = GPIO_AF5_SPI2;
    HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

    GPIO_InitStruct.Pin = GPIO_PIN_13|GPIO_PIN_15;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FAST;
    GPIO_InitStruct.Alternate = GPIO_AF5_SPI2;
    HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);
		
		/*Configure IRQ[I], BUSY[I] ,CS[O] PIN*/
		
		GPIO_InitStruct.Pin = GPIO_PIN_12;
    GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FAST;
    HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);
		
		GPIO_InitStruct.Pin = GPIO_PIN_14;
    GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
    GPIO_InitStruct.Pull = GPIO_PULLUP;
    GPIO_InitStruct.Speed = GPIO_SPEED_FAST;
    HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);
		
		GPIO_InitStruct.Pin = GPIO_PIN_5;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FAST;
    HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);
}	
static void SPI_MspDeInit(void)
{
  /*##-1- Reset peripherals ##################################################*/
  SPIx_FORCE_RESET();
  SPIx_RELEASE_RESET();

  /*##-2- Disable peripherals and GPIO Clocks ################################*/
  /* Configure SPI SCK as alternate function  */
  HAL_GPIO_DeInit(GPIOB, GPIO_PIN_13);
  /* Configure SPI MISO as alternate function  */
  HAL_GPIO_DeInit(GPIOB, GPIO_PIN_15);
  /* Configure SPI MOSI as alternate function  */
  HAL_GPIO_DeInit(GPIOC, GPIO_PIN_2);
  
  /*##-3- Disable the NVIC for SPI ###########################################*/
  HAL_NVIC_DisableIRQ(SPIx_IRQn);
}
uint16_t TS2_Read_X(void)
{
	uint16_t AdcValue;
	TP2_CS(0);
	SpiDelay(10);
	/*
		TSC2046 控制字（8Bit）
		Bit7   = S     起始位，必须是1
		Bit6:4 = A2-A0 模拟输入通道选择A2-A0; 共有6个通道。
		Bit3   = MODE  ADC位数选择，0 表示12Bit;1表示8Bit
		Bit2   = SER/DFR 模拟输入形式，  1表示单端输入；0表示差分输入
		Bit1:0 = PD1-PD0 掉电模式选择位
	*/
	SPI_ShiftByte(CHX);			/* 选择通道1, 测量X位置 */
	SpiDelay(10);
	/* 读ADC结果, 12位ADC值的高位先传，前12bit有效，最后4bit填0 */
	AdcValue = SPI_ShiftByte(0x00);		/* 发送的0x00可以为任意值，无意义 */
	AdcValue <<= 8;
	AdcValue += SPI_ShiftByte(0x00);		/* 获得12位的ADC采样值 */
	AdcValue >>= 3;						/* 右移3位，保留12位有效数字 */
	AdcValue &= 0xFFF;
	TP2_CS(1);	

	return (AdcValue);
}
uint16_t TS2_Read_Y(void)
{
	uint16_t AdcValue;
	TP2_CS(0);
	SpiDelay(10);
	/*
		TSC2046 控制字（8Bit）
		Bit7   = S     起始位，必须是1
		Bit6:4 = A2-A0 模拟输入通道选择A2-A0; 共有6个通道。
		Bit3   = MODE  ADC位数选择，0 表示12Bit;1表示8Bit
		Bit2   = SER/DFR 模拟输入形式，  1表示单端输入；0表示差分输入
		Bit1:0 = PD1-PD0 掉电模式选择位
	*/
	SPI_ShiftByte(CHY);			/* 选择通道1, 测量X位置 */
	SpiDelay(10);
	/* 读ADC结果, 12位ADC值的高位先传，前12bit有效，最后4bit填0 */
	AdcValue = SPI_ShiftByte(0x00);		/* 发送的0x00可以为任意值，无意义 */
	AdcValue <<= 8;
	AdcValue += SPI_ShiftByte(0x00);		/* 获得12位的ADC采样值 */
	AdcValue >>= 3;						/* 右移3位，保留12位有效数字 */
	AdcValue &= 0xFFF;
	TP2_CS(1);	

	return (AdcValue);
}
static uint8_t SPI_ShiftByte(uint8_t TxData)
{
	uint8_t RxData[1]={0};
	uint8_t TxByte[1]={0};
	
		TxByte[0] = TxData;
//		HAL_SPI_TransmitReceive_IT(&SpiHandle,TxByte, RxData,sizeof(TxByte));
		HAL_SPI_Transmit(&SpiHandle, TxByte,1,1);
		SpiDelay(10);
		HAL_SPI_Receive(&SpiHandle, RxData,1,1);
		SpiDelay(10);
	return RxData[0];
} 
static void TP2_CS(uint8_t State){
	if(State)
	HAL_GPIO_WritePin(TP_CS_PORT,TP_CS_PIN,GPIO_PIN_SET);
	else
	HAL_GPIO_WritePin(TP_CS_PORT,TP_CS_PIN,GPIO_PIN_RESET);
}
static void TP2_CLK(uint8_t State){
	if(State)
	HAL_GPIO_WritePin(TP_SPIx_SCK_GPIO_PORT,TP_SPIx_SCK_PIN,GPIO_PIN_SET);
	else
	HAL_GPIO_WritePin(TP_SPIx_SCK_GPIO_PORT,TP_SPIx_SCK_PIN,GPIO_PIN_RESET);
}
static void TP2_DIN(uint8_t State){
	if(State)
	HAL_GPIO_WritePin(TP_SPIx_MOSI_GPIO_PORT,TP_SPIx_MOSI_PIN,GPIO_PIN_SET);
	else
	HAL_GPIO_WritePin(TP_SPIx_MOSI_GPIO_PORT,TP_SPIx_MOSI_PIN,GPIO_PIN_RESET);
}
static void TP2_DOUT(uint8_t State){
	if(State)
	HAL_GPIO_WritePin(TP_SPIx_MISO_GPIO_PORT,TP_SPIx_MISO_PIN,GPIO_PIN_SET);
	else
	HAL_GPIO_WritePin(TP_SPIx_MISO_GPIO_PORT,TP_SPIx_MISO_PIN,GPIO_PIN_RESET);
}
static void SpiDelay(unsigned int DelayCnt)
{
 unsigned int i;
 for(i=0;i<DelayCnt;i++);
}


void TS3_Init(void)
{
	GPIO_InitTypeDef GPIO_InitStruct;
	/*Enable clock GPIOB,GPIOC*/
	__GPIOB_CLK_ENABLE();
	__GPIOC_CLK_ENABLE();
	
	//Configure CS Pin out
  GPIO_InitStruct.Pin = GPIO_PIN_5;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FAST;
	HAL_GPIO_Init(GPIOB,&GPIO_InitStruct);
	
		//Configure IRQ[I] & BUSY[I] 
  GPIO_InitStruct.Pin = GPIO_PIN_12;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FAST;
	HAL_GPIO_Init(GPIOB,&GPIO_InitStruct);
	
	GPIO_InitStruct.Pin = GPIO_PIN_14;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  GPIO_InitStruct.Speed = GPIO_SPEED_FAST;
	HAL_GPIO_Init(GPIOB,&GPIO_InitStruct);
	/*Configure SPI2*/
	/*Configure MISO[I]*/
	GPIO_InitStruct.Pin = GPIO_PIN_2;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FAST;
//	GPIO_InitStruct.Alternate = GPIO_AF5_SPI2;
	HAL_GPIO_Init(GPIOC,&GPIO_InitStruct);
		/*Configure MOSI[O], SCK[O]*/
	GPIO_InitStruct.Pin = GPIO_PIN_13|GPIO_PIN_15;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FAST;
//	GPIO_InitStruct.Alternate = GPIO_AF5_SPI2;
	HAL_GPIO_Init(GPIOB,&GPIO_InitStruct);
	
	TP3_CS(1);
	TP3_CLK(0);
	TP3_DIN(0);
}

uint16_t TS3_Read_X(void){
	return TS3_Read_AD(CHX);
}
uint16_t TS3_Read_Y(void){
	return TS3_Read_AD(CHY);
}
uint32_t TS3_DetectTouch(void)
{
  __IO uint8_t status = 1;
  if(HAL_GPIO_ReadPin(TP_IRQ_PORT, TP_IRQ_PIN) != GPIO_PIN_RESET) 
  {
    status = 0;
  }
  
