nguyenvuhung/STM32Cube_FW_F4/Drivers/BSP/STM32F429_EVAL_CUSTOMIZE/stm324x9i_eval_revision.c
  return status;
}
static uint16_t TS3_Read_AD(uint8_t CMD)	  
{ 	 
	uint8_t i;
	uint8_t count=0; 	  
	uint16_t Num=0; 
//	T_DCLK_L;//先拉低时钟 	 
	TP3_CS(0); //选中ADS7843	 
	TS3_WriteCmd(CMD);//发送命令字
//	T_DCLK_L; 
	for(volatile int i=400;i>0;i--)__nop();
//	T_DCLK_H;//给1个时钟，清除BUSY  
//	__nop();__nop();
//	__nop();__nop(); 	    
//	T_DCLK_L; 	 
	for(uint8_t count=0;count<16;count++)  
	{ 				  
		Num<<=1; 
		TP3_CLK(0);//下降沿有效  
		__nop();__nop();
		__nop();__nop();
		TP3_CLK(1);
		__nop();__nop();
		__nop();__nop();
		if(HAL_GPIO_ReadPin(TP_SPIx_MOSI_GPIO_PORT,TP_SPIx_MOSI_PIN)){
			Num++; 	
		}			
	}  	
	Num>>=4;   //只有高12位有效.
	TP3_CS(1);//释放ADS7843	 
	return(Num);   
}


static void TS3_WriteCmd(uint8_t Cmd)    
{  
	uint8_t count=0;   
	for(count=0;count<8;count++)  
	{ 	  
		if(Cmd&0x80)TP3_DOUT(1);  
		else TP3_DOUT(0);   
		Cmd<<=1;   
		TP3_CLK(0);//上升沿有效
		__nop();__nop();
		TP3_CLK(1); 
		__nop();__nop();
	} 			    
} 
static void TP3_CS(uint8_t State){
	if(State)
	HAL_GPIO_WritePin(TP_CS_PORT,TP_CS_PIN,GPIO_PIN_SET);
	else
	HAL_GPIO_WritePin(TP_CS_PORT,TP_CS_PIN,GPIO_PIN_RESET);
}
static void TP3_CLK(uint8_t State){
	if(State)
	HAL_GPIO_WritePin(TP_SPIx_SCK_GPIO_PORT,TP_SPIx_SCK_PIN,GPIO_PIN_SET);
	else
	HAL_GPIO_WritePin(TP_SPIx_SCK_GPIO_PORT,TP_SPIx_SCK_PIN,GPIO_PIN_RESET);
}
static void TP3_DIN(uint8_t State){
	if(State)
	HAL_GPIO_WritePin(TP_SPIx_MOSI_GPIO_PORT,TP_SPIx_MOSI_PIN,GPIO_PIN_SET);
	else
	HAL_GPIO_WritePin(TP_SPIx_MOSI_GPIO_PORT,TP_SPIx_MOSI_PIN,GPIO_PIN_RESET);
}
static void TP3_DOUT(uint8_t State){
	if(State)
	HAL_GPIO_WritePin(TP_SPIx_MISO_GPIO_PORT,TP_SPIx_MISO_PIN,GPIO_PIN_SET);
	else
	HAL_GPIO_WritePin(TP_SPIx_MISO_GPIO_PORT,TP_SPIx_MISO_PIN,GPIO_PIN_RESET);
}


//******************************************LINK FMC********************************************************8
/*************************** FSMC Routines ************************************/
/**
  * @brief  Initializes FSMC_BANK3 MSP.
  * @param  None
  * @retval None
  */
static void FMC_BANK1_MspInit(void)
{
 GPIO_InitTypeDef GPIO_Init_Structure;
    
  /* Enable FSMC clock */
  __FMC_CLK_ENABLE();

  /* Enable GPIOs clock */
  __GPIOD_CLK_ENABLE();
  __GPIOE_CLK_ENABLE();
  __GPIOF_CLK_ENABLE();
  __GPIOG_CLK_ENABLE();
  
  /* Common GPIO configuration */
  GPIO_Init_Structure.Mode      = GPIO_MODE_AF_PP;
  GPIO_Init_Structure.Pull      = GPIO_PULLUP;
  GPIO_Init_Structure.Speed     = GPIO_SPEED_HIGH;
  GPIO_Init_Structure.Alternate = GPIO_AF12_FMC;
  
  /* GPIOD configuration */
  GPIO_Init_Structure.Pin   = GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_4 | GPIO_PIN_5 |GPIO_PIN_7| GPIO_PIN_8     |\
                              GPIO_PIN_9 | GPIO_PIN_10 |GPIO_PIN_14 | GPIO_PIN_15;
   
  HAL_GPIO_Init(GPIOD, &GPIO_Init_Structure);

  /* GPIOE configuration */  
  GPIO_Init_Structure.Pin   = GPIO_PIN_3| GPIO_PIN_7 | GPIO_PIN_8 | GPIO_PIN_9 | GPIO_PIN_10 | \
															GPIO_PIN_11 | GPIO_PIN_12 |GPIO_PIN_13 | GPIO_PIN_14 | GPIO_PIN_15;
  HAL_GPIO_Init(GPIOE, &GPIO_Init_Structure);
  
  /* GPIOF configuration */  
  GPIO_Init_Structure.Pin   = GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_2| GPIO_PIN_3 | GPIO_PIN_4     |\
                              GPIO_PIN_5 | GPIO_PIN_12 | GPIO_PIN_13 | GPIO_PIN_14 | GPIO_PIN_15;
  HAL_GPIO_Init(GPIOF, &GPIO_Init_Structure);
  
  /* GPIOG configuration */  
  GPIO_Init_Structure.Pin   = GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_2| GPIO_PIN_3 | GPIO_PIN_4     |\
                              GPIO_PIN_5 |GPIO_PIN_9;
  
  HAL_GPIO_Init(GPIOG, &GPIO_Init_Structure);  
	 /* Blacklight configuration PB0 */
  GPIO_Init_Structure.Pin = GPIO_PIN_0;
  GPIO_Init_Structure.Mode = GPIO_MODE_OUTPUT_PP;
	GPIO_Init_Structure.Pull=GPIO_NOPULL;
	GPIO_Init_Structure.Speed=GPIO_SPEED_FAST;
	GPIO_Init_Structure.Alternate=GPIO_AF0_MCO;
	HAL_GPIO_Init(GPIOB,&GPIO_Init_Structure);
	HAL_GPIO_WritePin(GPIOB,GPIO_PIN_0,GPIO_PIN_SET);

}

/**
  * @brief  Initializes LCD IO.
  * @param  None
  * @retval None
  */
static void FMC_BANK1_Init(void) 
{  
  SRAM_HandleTypeDef hsram;
  FMC_NORSRAM_TimingTypeDef SRAM_Timing;
  
  /*** Configure the SRAM Bank 1 ***/  
  /* Configure IPs */
  hsram.Instance  = FMC_NORSRAM_DEVICE;
  hsram.Extended  = FMC_NORSRAM_EXTENDED_DEVICE;

  SRAM_Timing.AddressSetupTime      = 1;
  SRAM_Timing.AddressHoldTime       = 0;
  SRAM_Timing.DataSetupTime         = 9;
  SRAM_Timing.BusTurnAroundDuration = 0;
  SRAM_Timing.CLKDivision           = 0;
  SRAM_Timing.DataLatency           = 0;
  SRAM_Timing.AccessMode            = FMC_ACCESS_MODE_A;
  
  hsram.Init.NSBank             = FMC_NORSRAM_BANK1; //chon Bank 1
  hsram.Init.DataAddressMux     = FMC_DATA_ADDRESS_MUX_DISABLE;
  hsram.Init.MemoryType         = FMC_MEMORY_TYPE_SRAM;
  hsram.Init.MemoryDataWidth    = FMC_NORSRAM_MEM_BUS_WIDTH_16;
  hsram.Init.BurstAccessMode    = FMC_BURST_ACCESS_MODE_DISABLE;
	hsram.Init.AsynchronousWait 	= FMC_ASYNCHRONOUS_WAIT_DISABLE;
  hsram.Init.WaitSignalPolarity = FMC_WAIT_SIGNAL_POLARITY_LOW;
  hsram.Init.WrapMode           = FMC_WRAP_MODE_DISABLE;
  hsram.Init.WaitSignalActive   = FMC_WAIT_TIMING_BEFORE_WS;
  hsram.Init.WriteOperation     = FMC_WRITE_OPERATION_ENABLE;
  hsram.Init.WaitSignal         = FMC_WAIT_SIGNAL_DISABLE;
  hsram.Init.ExtendedMode       = FMC_EXTENDED_MODE_DISABLE;
  hsram.Init.WriteBurst         = FMC_WRITE_BURST_DISABLE;

 
  /* Initialize the SRAM controller */
  FMC_BANK1_MspInit();
  HAL_SRAM_Init(&hsram, &SRAM_Timing, &SRAM_Timing);   
}

/**
  * @brief  Writes register value.
  * @param  Data: Data to be written 
  * @retval None
  */
static void FMC_BANK1_WriteData(uint16_t Data) 
{
  /* Write 16-bit Reg */
 // FMC_BANK3->RAM = Data;
	LCD_DATA=Data;
}

/**
  * @brief  Writes register address.
  * @param  Reg: Register to be written
  * @retval None
  */
static void FMC_BANK1_WriteReg(uint8_t Reg) 
{
  /* Write 16-bit Index, then write register */
//  FMC_BANK3->REG = Reg;
	LCD_CMD=Reg;
}

/**
  * @brief  Reads register value.
  * @param  None
  * @retval Read value
  */
static uint16_t FMC_BANK1_ReadData(void) 
{
 // return FMC_BANK3->RAM;
	return LCD_DATA;
}
//****************************************************LINK LCD**************************************************
/********************************* LINK LCD ***********************************/

/**
  * @brief  Initializes LCD low level.
  * @param  None
  * @retval None
  */
void LCD_IO_Init(void) 
{
  if(Is_LCD_IO_Initialized == 0)
  {
    Is_LCD_IO_Initialized = 1; 
    FMC_BANK1_Init();
  }
}

/**
  * @brief  Writes data on LCD data register.
  * @param  Data: Data to be written
  * @retval None
  */
void LCD_IO_WriteData(uint16_t Data) 
{
  /* Write 16-bit Reg */
  FMC_BANK1_WriteData(Data);
}

/**
  * @brief  Writes register on LCD register.
  * @param  Reg: Register to be written
  * @retval None
  */
void LCD_IO_WriteReg(uint8_t Reg) 
{
  /* Write 16-bit Index, then Write Reg */
  FMC_BANK1_WriteReg(Reg);
}

/**
  * @brief  Reads data from LCD data register.
  * @param  None
  * @retval Read data.
  */
uint16_t LCD_IO_ReadData(void) 
{
  return FMC_BANK1_ReadData();
}
/**
  * @}
  */

/**
  * @}
  */ 

/**
  * @}
  */

/**
  * @}
  */    
    
/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
